In [49]:
import pandas as pd
import numpy as np

In [8]:
df = pd.read_csv("Weather.csv")
df

          day  temperature  windspeed  event
0  01-01-2020           32          6   rain
1  01-02-2020           34          5  sunny
2  01-03-2020           35          4   snow
3  01-04-2020           32          3   snow
4  01-05-2020           31          4   rain
5  01-06-2020           36          7  sunny
6  01-07-2020           30          2   rain

In [4]:
#weather = {
#  #   'temperature' : [34,32,33],
#     'day': ['sunday','monday','tuesday']
# }
# df = pd.DataFrame(weather)
# df

   temperature      day
0           34   sunday
1           32   monday
2           33  tuesday

In [9]:
df.shape #size of the table

(7, 4)

In [10]:
df.head() #first 5 rows

          day  temperature  windspeed  event
0  01-01-2020           32          6   rain
1  01-02-2020           34          5  sunny
2  01-03-2020           35          4   snow
3  01-04-2020           32          3   snow
4  01-05-2020           31          4   rain

In [11]:
df.head(3)

          day  temperature  windspeed  event
0  01-01-2020           32          6   rain
1  01-02-2020           34          5  sunny
2  01-03-2020           35          4   snow

In [12]:
df[2:5]

          day  temperature  windspeed event
2  01-03-2020           35          4  snow
3  01-04-2020           32          3  snow
4  01-05-2020           31          4  rain

In [13]:
df.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [15]:
df.day # or df['day']

0    01-01-2020
1    01-02-2020
2    01-03-2020
3    01-04-2020
4    01-05-2020
5    01-06-2020
6    01-07-2020
Name: day, dtype: object

In [16]:
type(df) #datatype

pandas.core.frame.DataFrame

In [17]:
type(df['day'])

pandas.core.series.Series

In [18]:
df[['day', 'temperature']]  #printing selected columns

          day  temperature
0  01-01-2020           32
1  01-02-2020           34
2  01-03-2020           35
3  01-04-2020           32
4  01-05-2020           31
5  01-06-2020           36
6  01-07-2020           30

In [20]:
df['temperature'].max() #printing maximum value

36

In [21]:
df.describe() #only integer columns

       temperature  windspeed
count     7.000000   7.000000
mean     32.857143   4.428571
std       2.193063   1.718249
min      30.000000   2.000000
25%      31.500000   3.500000
50%      32.000000   4.000000
75%      34.500000   5.500000
max      36.000000   7.000000

In [22]:
df[['day', 'event']][df.temperature == df['temperature'].max()]

          day  event
5  01-06-2020  sunny

In [25]:
df[df['temperature']==df['temperature'].max()]

          day  temperature  windspeed  event
5  01-06-2020           36          7  sunny

In [26]:
df[df['event']=='sunny']

          day  temperature  windspeed  event
1  01-02-2020           34          5  sunny
5  01-06-2020           36          7  sunny

In [28]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [29]:
df.set_index('day') # doesn't chnage the original dataframe

            temperature  windspeed  event
day
01-01-2020           32          6   rain
01-02-2020           34          5  sunny
01-03-2020           35          4   snow
01-04-2020           32          3   snow
01-05-2020           31          4   rain
01-06-2020           36          7  sunny
01-07-2020           30          2   rain

In [31]:
df.set_index('windspeed')

                  day  temperature  event
windspeed
6          01-01-2020           32   rain
5          01-02-2020           34  sunny
4          01-03-2020           35   snow
3          01-04-2020           32   snow
4          01-05-2020           31   rain
7          01-06-2020           36  sunny
2          01-07-2020           30   rain

In [32]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [33]:
df1 = df.set_index('day') # or df.set_index('day', inplace=True)

In [34]:
df1

            temperature  windspeed  event
day
01-01-2020           32          6   rain
01-02-2020           34          5  sunny
01-03-2020           35          4   snow
01-04-2020           32          3   snow
01-05-2020           31          4   rain
01-06-2020           36          7  sunny
01-07-2020           30          2   rain

In [39]:
df.loc["snow"]

              day  temperature  windspeed
event
snow   01-03-2020           35          4
snow   01-04-2020           32          3

## Querying a series

In [41]:
countries = {
    'bhutan': 'archery',
    'india': 'hockey',
    'japan': 'sumo',
    'england': 'cricket'
}
c = pd.Series(countries)
c

bhutan     archery
india       hockey
japan         sumo
england    cricket
dtype: object

In [47]:
c[2]

'sumo'

In [48]:
c.iloc[2]

'sumo'

In [50]:
c.loc['bhutan'] #same as c.iloc[0]

'archery'

In [51]:
c.loc['bhutan'] == c.iloc[0]

True

## Merging dataframes

In [52]:
import pandas as pd

df = pd.DataFrame([{'Name': 'Chris', 'Item Purchased': 'Sponge', 'Cost': 22.50},
                   {'Name': 'Kevyn', 'Item Purchased': 'Kitty Litter', 'Cost': 2.50},
                   {'Name': 'Filip', 'Item Purchased': 'Spoon', 'Cost': 5.00}],
                  index=['Store 1', 'Store 1', 'Store 2'])
df

          Name Item Purchased  Cost
Store 1  Chris         Sponge  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Filip          Spoon   5.0

In [53]:
df['Date'] = ['December 1', 'January 1', 'Mid-day']

In [54]:
df['Feedback'] = ['Positive', None, 'Negative']
df

          Name Item Purchased  Cost        Date  Feedback
Store 1  Chris         Sponge  22.5  December 1  Positive
Store 1  Kevyn   Kitty Litter   2.5   January 1      None
Store 2  Filip          Spoon   5.0     Mid-day  Negative

In [56]:
df.iloc[2]

Name                 Filip
Item Purchased       Spoon
Cost                     5
Date               Mid-day
Feedback          Negative
Name: Store 2, dtype: object

In [57]:
adf = df.reset_index()

In [58]:
adf

     index   Name Item Purchased  Cost        Date  Feedback
0  Store 1  Chris         Sponge  22.5  December 1  Positive
1  Store 1  Kevyn   Kitty Litter   2.5   January 1      None
2  Store 2  Filip          Spoon   5.0     Mid-day  Negative

In [59]:
adf['Date'] = ['January 13', 'Feb 4', 'September 12']
adf

     index   Name Item Purchased  Cost          Date  Feedback
0  Store 1  Chris         Sponge  22.5    January 13  Positive
1  Store 1  Kevyn   Kitty Litter   2.5         Feb 4      None
2  Store 2  Filip          Spoon   5.0  September 12  Negative

In [60]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR'},
                         {'Name': 'Sally', 'Role': 'Course liasion'},
                         {'Name': 'James', 'Role': 'Grader'}])

student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business'},
                           {'Name': 'Mike', 'School': 'Law'},
                           {'Name': 'Sally', 'School': 'Engineering'}])

print(student_df)
print(staff_df)

    Name       School
0  James     Business
1   Mike          Law
2  Sally  Engineering
    Name            Role
0  Kelly  Director of HR
1  Sally  Course liasion
2  James          Grader

In [61]:
pd.merge(staff_df, student_df, how='outer', left_index=True, right_index=True)

  Name_x            Role Name_y       School
0  Kelly  Director of HR  James     Business
1  Sally  Course liasion   Mike          Law
2  James          Grader  Sally  Engineering

In [62]:
pd.merge(staff_df, student_df, how='inner', left_index=True, right_index=True)

  Name_x            Role Name_y       School
0  Kelly  Director of HR  James     Business
1  Sally  Course liasion   Mike          Law
2  James          Grader  Sally  Engineering

In [63]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR', 'Location': 'State Street'},
                         {'Name': 'Sally', 'Role': 'Course liasion', 'Location': 'Washington Avenue'},
                         {'Name': 'James', 'Role': 'Grader', 'Location': 'Washington Avenue'}])
student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business', 'Location': '1024 Billiard Avenue'},
                           {'Name': 'Mike', 'School': 'Law', 'Location': 'Fraternity House #22'},
                           {'Name': 'Sally', 'School': 'Engineering', 'Location': '512 Wilson Crescent'}])
pd.merge(staff_df, student_df, how='left', left_on='Name', right_on='Name')

    Name            Role         Location_x       School            Location_y
0  Kelly  Director of HR       State Street          NaN                   NaN
1  Sally  Course liasion  Washington Avenue  Engineering   512 Wilson Crescent
2  James          Grader  Washington Avenue     Business  1024 Billiard Avenue

In [64]:
staff_df = pd.DataFrame([{'First Name': 'Kelly', 'Last Name': 'Desjardins', 'Role': 'Director of HR'},
                         {'First Name': 'Sally', 'Last Name': 'Brooks', 'Role': 'Course liasion'},
                         {'First Name': 'James', 'Last Name': 'Wilde', 'Role': 'Grader'}])
student_df = pd.DataFrame([{'First Name': 'James', 'Last Name': 'Hammond', 'School': 'Business'},
                           {'First Name': 'Mike', 'Last Name': 'Smith', 'School': 'Law'},
                           {'First Name': 'Sally', 'Last Name': 'Brooks', 'School': 'Engineering'}])
staff_df
student_df
pd.merge(staff_df, student_df, how='inner', left_on=['First Name','Last Name'], right_on=['First Name','Last Name'])

  First Name Last Name            Role       School
0      Sally    Brooks  Course liasion  Engineering